Repository: Productbird/productbird-wp
Catalog: languages/productbird-*.po
Languages: nl_nl

source: Productbird helps ecommerce owners get more done by providing various AI tools.
nl_nl: Productbird helpt webshopeigenaren meer gedaan te krijgen door verschillende AI-tools aan te bieden.

source: Generate description with AI
nl_nl: Beschrijving genereren met AI

source: Filter by description
nl_nl: Filteren op beschrijving

source: No description
nl_nl: Geen beschrijving

source: AI generated
nl_nl: AI gegenereerd

source: Generate AI Description
nl_nl: AI-beschrijving genereren

source: Invalid request.
nl_nl: Ongeldige aanvraag.

source: Security check failed.
nl_nl: Beveiligingscontrole mislukt.

source: Productbird API key is missing. Please configure it in the settings.
nl_nl: Productbird API-sleutel ontbreekt. Configureer deze in de instellingen.

source: Invalid product selected.
nl_nl: Ongeldig product geselecteerd.

source: Productbird API returned Unauthorized. Please check your API key.
nl_nl: Productbird API gaf Ongeautoriseerd terug. Controleer je API-sleutel.

source: Insufficient credits available. Please purchase more credits to continue using Productbird.
nl_nl: Onvoldoende credits beschikbaar. Koop meer credits om Productbird te blijven gebruiken.

source: Failed to generate product description. Please try again.
nl_nl: Genereren van productbeschrijving mislukt. Probeer het opnieuw.

source: An unknown error occurred.
nl_nl: Er is een onbekende fout opgetreden.

source: Productbird has queued description generation. Status will update in the "AI Desc." column.
nl_nl: Productbird heeft de beschrijvingsgeneratie in de wachtrij gezet. De status wordt bijgewerkt in de "AI Desc." kolom.

source: No AI description requested
nl_nl: Geen AI-beschrijving aangevraagd

source: Description generated successfully
nl_nl: Beschrijving succesvol gegenereerd

source: Error generating description
nl_nl: Fout bij genereren beschrijving

source: Description generation queued
nl_nl: Beschrijvingsgeneratie in wachtrij

source: Description generation in progress
nl_nl: Beschrijvingsgeneratie in uitvoering

source: Productbird API request failed with status %d.
nl_nl: Productbird API-verzoek mislukt met status %d.

source: Failed to retrieve organization
nl_nl: Ophalen van organisatie mislukt

source: Not connected to Productbird
nl_nl: Niet verbonden met Productbird

source: Productbird requires WooCommerce to be installed and active.
nl_nl: Productbird vereist dat WooCommerce is geïnstalleerd en actief is.

source: You do not have permission to use this endpoint.
nl_nl: Je hebt geen toestemming om dit eindpunt te gebruiken.

source: You can only generate %s for up to %d products at a time.
nl_nl: Je kunt alleen %s genereren voor maximaal %d producten tegelijk.

source: API key not configured
nl_nl: API-sleutel niet geconfigureerd

source: No valid products found to process.
nl_nl: Geen geldige producten gevonden om te verwerken.

source: Missing productId or description.
nl_nl: ProductId of beschrijving ontbreekt.

source: Product not found.
nl_nl: Product niet gevonden.

source: Empty description content.
nl_nl: Lege beschrijvingsinhoud.

source: No product IDs provided.
nl_nl: Geen product-ID's opgegeven.

source: No description available to apply.
nl_nl: Geen beschrijving beschikbaar om toe te passen.

source: Description applied successfully.
nl_nl: Beschrijving succesvol toegepast.

source: Description declined.
nl_nl: Beschrijving afgewezen.

source: Description declined undone.
nl_nl: Afwijzen van beschrijving ongedaan gemaakt.

source: Generate product descriptions with AI
nl_nl: Genereer productbeschrijvingen met AI

source: Connect with Productbird
nl_nl: Verbinden met Productbird

source: Disconnect
nl_nl: Verbinding verbreken

source: Connected to Productbird
nl_nl: Verbonden met Productbird

source: Unable to create connect URL. Please try again later.
nl_nl: Kan verbindings-URL niet maken. Probeer het later opnieuw.

source: Hello %s 👋
nl_nl: Hallo %s 👋

source: Your current credit balance
nl_nl: Je huidige creditbalans

source: You are not connected to Productbird. Please enter your API key to continue.
nl_nl: Je bent niet verbonden met Productbird. Voer je API-sleutel in om door te gaan.

source: View activity
nl_nl: Activiteit bekijken

source: Get started
nl_nl: Aan de slag

source: Your API key is used to authenticate your requests to the Productbird API.
nl_nl: Je API-sleutel wordt gebruikt om je verzoeken aan de Productbird API te authenticeren.

source: You can manage your API key in the Productbird dashboard.
nl_nl: Je kunt je API-sleutel beheren in het Productbird dashboard.

source: Manage API key
nl_nl: API-sleutel beheren

source: Your webhook secret is used to verify webhook requests from Productbird.
nl_nl: Je webhook secret wordt gebruikt om webhook-verzoeken van Productbird te verifiëren.

source: You can manage your webhook secret in the Productbird dashboard.
nl_nl: Je kunt je webhook secret beheren in het Productbird dashboard.

source: Manage webhook secret
nl_nl: Webhook secret beheren

source: Connection Status
nl_nl: Verbindingsstatus

source: Your connected Productbird account
nl_nl: Je verbonden Productbird account

source: You can manage your organization in the Productbird dashboard.
nl_nl: Je kunt je organisatie beheren in het Productbird dashboard.

source: Manage organization
nl_nl: Organisatie beheren

source: Advanced Settings
nl_nl: Geavanceerde instellingen

source: Advanced settings and troubleshooting options
nl_nl: Geavanceerde instellingen en probleemoplossingsopties

source: Are you sure you want to clear all Productbird meta data? This cannot be undone.
nl_nl: Weet je zeker dat je alle Productbird meta-data wilt wissen? Dit kan niet ongedaan worden gemaakt.

source: Clearing...
nl_nl: Wissen...

source: Clear Product Meta
nl_nl: Product Meta wissen

source: Troubleshooting
nl_nl: Probleemoplossing

source: If you're experiencing issues with product descriptions, you can clear all Productbird meta data from your products.
nl_nl: Als je problemen ondervindt met productbeschrijvingen, kun je alle Productbird meta-data van je producten wissen.

source: Global Settings
nl_nl: Globale instellingen

source: These global settings will be used for all your tools.
nl_nl: Deze globale instellingen worden gebruikt voor al je tools.

source: Tone
nl_nl: Toon

source: Select the tone of the generated content.
nl_nl: Selecteer de toon van de gegenereerde inhoud.

source: Formality
nl_nl: Formaliteit

source: Select the formality of the generated content.
nl_nl: Selecteer de formaliteit van de gegenereerde inhoud.

source: There is %s error in the form
nl_nl: Er is %s fout in het formulier

source: There are %s errors in the form
nl_nl: Er zijn %s fouten in het formulier

source: Settings saved
nl_nl: Instellingen opgeslagen

source: Saving %s
nl_nl: Opslaan %s

source: Save settings
nl_nl: Instellingen opslaan

source: Unfortunately regenerate is not available yet. Please try again later.
nl_nl: Helaas is opnieuw genereren nog niet beschikbaar. Probeer het later opnieuw.

source: Generate AI product descriptions
nl_nl: AI-productbeschrijvingen genereren

source: You're about to generate descriptions for %s products using %s.
nl_nl: Je staat op het punt om beschrijvingen te genereren voor %s producten met %s.

source: Manual Review
nl_nl: Handmatige controle

source: Carefully review each generated description before applying it.
nl_nl: Controleer elke gegenereerde beschrijving zorgvuldig voordat je deze toepast.

source: YOLO Mode
nl_nl: YOLO-modus

source: Skip the review process. All descriptions will be applied automatically.
nl_nl: Sla het controleproces over. Alle beschrijvingen worden automatisch toegepast.

source: accepted
nl_nl: geaccepteerd

source: declined
nl_nl: afgewezen

source: These products already have AI descriptions.
nl_nl: Deze producten hebben al AI-beschrijvingen.

source: You can choose to regenerate them or skip them.
nl_nl: Je kunt ervoor kiezen om ze opnieuw te genereren of over te slaan.

source: Search by name or ID...
nl_nl: Zoeken op naam of ID...

source: Check all
nl_nl: Alles selecteren

source: Uncheck all
nl_nl: Alles deselecteren

source: = Regenerate description
nl_nl: = Beschrijving opnieuw genereren

source: = Skip this product
nl_nl: = Dit product overslaan

source: No products match your search.
nl_nl: Geen producten gevonden die overeenkomen met je zoekopdracht.

source: will be skipped
nl_nl: wordt overgeslagen

source: products will be regenerated
nl_nl: producten worden opnieuw gegenereerd

source: Cancel
nl_nl: Annuleren

source: Starting %s
nl_nl: Starten %s

source: Start Generation
nl_nl: Generatie starten

source: Review descriptions
nl_nl: Beschrijvingen controleren

source: %s of %s accepted
nl_nl: %s van %s geaccepteerd

source: Progress
nl_nl: Voortgang

source: %s descriptions still being generated...
nl_nl: %s beschrijvingen worden nog gegenereerd...

source: Take a final look at the generated content before applying it to your products.
nl_nl: Bekijk de gegenereerde inhoud een laatste keer voordat je deze toepast op je producten.

source: %s items remaining
nl_nl: %s items resterend

source: Generating descriptions...
nl_nl: Beschrijvingen genereren...

source: of
nl_nl: van

source: Previous
nl_nl: Vorige

source: Next
nl_nl: Volgende

source: Accepted
nl_nl: Geaccepteerd

source: Declined
nl_nl: Afgewezen

source: Ready for review
nl_nl: Klaar voor controle

source: Preview
nl_nl: Voorbeeld

source: Compare
nl_nl: Vergelijken

source: Current Description
nl_nl: Huidige beschrijving

source: Generated Description
nl_nl: Gegenereerde beschrijving

source: Close
nl_nl: Sluiten

source: Regenerate
nl_nl: Opnieuw genereren

source: Undo Decline
nl_nl: Afwijzen ongedaan maken

source: Decline
nl_nl: Afwijzen

source: Accepted ✓
nl_nl: Geaccepteerd ✓

source: Accept & Apply
nl_nl: Accepteren & Toepassen

source: Accept All
nl_nl: Alles accepteren

source: Decline All
nl_nl: Alles afwijzen

source: All descriptions processed
nl_nl: Alle beschrijvingen verwerkt

source: Your product catalog is looking better than ever.
nl_nl: Je productcatalogus ziet er beter uit dan ooit.

source: Thanks for using Productbird.
nl_nl: Bedankt voor het gebruik van Productbird.

source: You're all set!
nl_nl: Je bent helemaal klaar!

source: Continue
nl_nl: Doorgaan
